tuananh1592/DoAnFinal1/Stm32Register.h
#define GPIOA_BSRR_BR4_SHIFT       (20u)
#define GPIOA_BSRR_BR4_MASK        (0x100000u)
#define GPIOA_BSRR_BR4(x)          (((x) << GPIOA_BSRR_BR4_SHIFT) & (GPIOA_BSRR_BR4_MASK))

#define GPIOA_ODR4_SHIFT           (4u)
#define GPIOA_ODR4_MASK            (0x10u)
#define GPIOA_ODR4(x)              (((x) << GPIOA_ODR4_SHIFT) & GPIOA_ODR4_MASK)

#define GPIOA_IDR4_SHIFT           (4u)
#define GPIOA_IDR4_MASK            (0x10u)
#define GPIOA_IDR4(x)              (((x) << GPIOA_IDR4_SHIFT) & GPIOA_IDR4_MASK)

// ---------- PIN5 ----------
#define GPIOA_CRL_MODE5_SHIFT      (20u)
#define GPIOA_CRL_MODE5_MASK       (0x300000u)
#define GPIOA_CRL_MODE5(x)         (((x) << GPIOA_CRL_MODE5_SHIFT) & (GPIOA_CRL_MODE5_MASK))

#define GPIOA_CRL_CNF5_SHIFT       (22u)
#define GPIOA_CRL_CNF5_MASK        (0xC00000u)
#define GPIOA_CRL_CNF5(x)          (((x) << GPIOA_CRL_CNF5_SHIFT) & (GPIOA_CRL_CNF5_MASK))

#define GPIOA_BSRR_BS5_SHIFT       (5u)
#define GPIOA_BSRR_BS5_MASK        (0x20u)
#define GPIOA_BSRR_BS5(x)          (((x) << GPIOA_BSRR_BS5_SHIFT) & (GPIOA_BSRR_BS5_MASK))

#define GPIOA_BSRR_BR5_SHIFT       (21u)
#define GPIOA_BSRR_BR5_MASK        (0x200000u)
#define GPIOA_BSRR_BR5(x)          (((x) << GPIOA_BSRR_BR5_SHIFT) & (GPIOA_BSRR_BR5_MASK))

#define GPIOA_ODR5_SHIFT           (5u)
#define GPIOA_ODR5_MASK            (0x20)
#define GPIOA_ODR5(x)              (((x) << GPIOA_ODR5_SHIFT) & GPIOA_ODR5_MASK)

#define GPIOA_IDR5_SHIFT           (5u)
#define GPIOA_IDR5_MASK            (0x20u)
#define GPIOA_IDR5(x)              (((x) << GPIOA_IDR5_SHIFT) & GPIOA_IDR5_MASK)

// ---------- PIN6 ----------
#define GPIOA_CRL_MODE6_SHIFT      (24u)
#define GPIOA_CRL_MODE6_MASK       (0x3000000u)
#define GPIOA_CRL_MODE6(x)         (((x)<<GPIOA_CRL_MODE6_SHIFT) & (GPIOA_CRL_MODE6_MASK))

#define GPIOA_CRL_CNF6_SHIFT       (26u)
#define GPIOA_CRL_CNF6_MASK        (0xC000000u)
#define GPIOA_CRL_CNF6(x)          (((x)<<GPIOA_CRL_CNF6_SHIFT) & (GPIOA_CRL_CNF6_MASK))

#define GPIOA_BSRR_BS6_SHIFT       (6u)
#define GPIOA_BSRR_BS6_MASK        (0x40u)
#define GPIOA_BSRR_BS6(x)          (((x)<<GPIOA_BSRR_BS6_SHIFT) & (GPIOA_BSRR_BS6_MASK))

#define GPIOA_BSRR_BR6_SHIFT       (22u)
#define GPIOA_BSRR_BR6_MASK        (0x400000u)
#define GPIOA_BSRR_BR6(x)          (((x)<<GPIOA_BSRR_BR6_SHIFT) & (GPIOA_BSRR_BR6_MASK))

#define GPIOA_ODR6_SHIFT 		   (6u)
#define GPIOA_ODR6_MASK  		   (0x40u)
#define GPIOA_ODR6(x)    		   (((x) << GPIOA_ODR6_SHIFT) & GPIOA_ODR6_MASK)

#define GPIOA_IDR6_SHIFT 		   (6u)
#define GPIOA_IDR6_MASK  		   (0x40u)
#define GPIOA_IDR6(x)    		   (((x) << GPIOA_IDR6_SHIFT) & GPIOA_IDR6_MASK)


// ---------- PIN7 ----------
#define GPIOA_CRL_MODE7_SHIFT      (28u)
#define GPIOA_CRL_MODE7_MASK       (0x30000000u)
#define GPIOA_CRL_MODE7(x)         (((x)<<GPIOA_CRL_MODE7_SHIFT) & (GPIOA_CRL_MODE7_MASK))

#define GPIOA_CRL_CNF7_SHIFT       (30u)
#define GPIOA_CRL_CNF7_MASK        (0xC0000000u)
#define GPIOA_CRL_CNF7(x)          (((x)<<GPIOA_CRL_CNF7_SHIFT) & (GPIOA_CRL_CNF7_MASK))

#define GPIOA_BSRR_BS7_SHIFT       (7u)
#define GPIOA_BSRR_BS7_MASK        (0x80u)
#define GPIOA_BSRR_BS7(x)          (((x)<<GPIOA_BSRR_BS7_SHIFT) & (GPIOA_BSRR_BS7_MASK))

#define GPIOA_BSRR_BR7_SHIFT       (23u)
#define GPIOA_BSRR_BR7_MASK        (0x800000u)
#define GPIOA_BSRR_BR7(x)          (((x)<<GPIOA_BSRR_BR7_SHIFT) & (GPIOA_BSRR_BR7_MASK))

#define GPIOA_ODR7_SHIFT 		   (7u)
#define GPIOA_ODR7_MASK            (0x80u)
#define GPIOA_ODR7(x)    	   	   (((x) << GPIOA_ODR7_SHIFT) & GPIOA_ODR7_MASK)

#define GPIOA_IDR7_SHIFT 		   (7u)
#define GPIOA_IDR7_MASK        	   (0x80u)
#define GPIOA_IDR7(x)   		   (((x) << GPIOA_IDR7_SHIFT) & GPIOA_IDR7_MASK)

// ---------- PIN8 ----------
#define GPIOA_CRH_MODE8_SHIFT      (0u) // bit bat dau
#define GPIOA_CRH_MODE8_MASK       (0x3u) // Onl bit 0 1
#define GPIOA_CRH_MODE8(x)         (((x)<<GPIOA_CRH_MODE8_SHIFT) & (GPIOA_CRH_MODE8_MASK))

#define GPIOA_CRH_CNF8_SHIFT       (2u)
#define GPIOA_CRH_CNF8_MASK        (0xCu) // Onl bit 2 3
#define GPIOA_CRH_CNF8(x)          (((x)<<GPIOA_CRH_CNF8_SHIFT) & (GPIOA_CRH_CNF8_MASK))

#define GPIOA_BSRR_BS8_SHIFT       (8u)
#define GPIOA_BSRR_BS8_MASK        (0x100u) // Onl bit 8
#define GPIOA_BSRR_BS8(x)          (((x)<<GPIOA_BSRR_BS8_SHIFT) & (GPIOA_BSRR_BS8_MASK))

#define GPIOA_BSRR_BR8_SHIFT       (24u) // bit bat dau
#define GPIOA_BSRR_BR8_MASK        (0x1000000u) // Onl bit 24
#define GPIOA_BSRR_BR8(x)          (((x)<<GPIOA_BSRR_BR8_SHIFT) & (GPIOA_BSRR_BR8_MASK))

// ---------- PIN9 ----------
#define GPIOA_CRH_MODE9_SHIFT      (4u) // bit bat dau
#define GPIOA_CRH_MODE9_MASK       (0x30u) // Onl bit 4 5
#define GPIOA_CRH_MODE9(x)         (((x)<<GPIOA_CRH_MODE9_SHIFT) & (GPIOA_CRH_MODE9_MASK))

#define GPIOA_CRH_CNF9_SHIFT       (6u)
#define GPIOA_CRH_CNF9_MASK        (0xC0u) // Onl bit 6 7
#define GPIOA_CRH_CNF9(x)          (((x)<<GPIOA_CRH_CNF9_SHIFT) & (GPIOA_CRH_CNF9_MASK))

#define GPIOA_BSRR_BS9_SHIFT       (9u)
#define GPIOA_BSRR_BS9_MASK        (0x200u) // Onl bit 9
#define GPIOA_BSRR_BS9(x)          (((x)<<GPIOA_BSRR_BS9_SHIFT) & (GPIOA_BSRR_BS9_MASK))

#define GPIOA_BSRR_BR9_SHIFT       (25u) // bit bat dau
#define GPIOA_BSRR_BR9_MASK        (0x2000000u) // Onl bit 25
#define GPIOA_BSRR_BR9(x)          (((x)<<GPIOA_BSRR_BR9_SHIFT) & (GPIOA_BSRR_BR9_MASK))

// ---------- PIN10 ----------
#define GPIOA_CRH_MODE10_SHIFT     (8u) // bit bat dau
#define GPIOA_CRH_MODE10_MASK      (0x300u) // Onl bit 8 9
#define GPIOA_CRH_MODE10(x)        (((x)<<GPIOA_CRH_MODE10_SHIFT) & (GPIOA_CRH_MODE10_MASK))

#define GPIOA_CRH_CNF10_SHIFT      (10u)
#define GPIOA_CRH_CNF10_MASK       (0xC00u) // Onl bit 10 11
#define GPIOA_CRH_CNF10(x)         (((x)<<GPIOA_CRH_CNF10_SHIFT) & (GPIOA_CRH_CNF10_MASK))

#define GPIOA_BSRR_BS10_SHIFT      (10u)
#define GPIOA_BSRR_BS10_MASK       (0x400u) // onl bit 10
#define GPIOA_BSRR_BS10(x)         (((x)<<GPIOA_BSRR_BS10_SHIFT) & (GPIOA_BSRR_BS10_MASK))

#define GPIOA_BSRR_BR10_SHIFT      (26u) // bit bat dau
#define GPIOA_BSRR_BR10_MASK       (0x4000000u) // onl bit 26
#define GPIOA_BSRR_BR10(x)         (((x)<<GPIOA_BSRR_BR10_SHIFT) & (GPIOA_BSRR_BR10_MASK))

// ---------- PIN11 ----------
#define GPIOA_CRH_MODE11_SHIFT     (12u) // bit bat dau
#define GPIOA_CRH_MODE11_MASK      (0x3000u) // Onl bit 12 13
#define GPIOA_CRH_MODE11(x)        (((x)<<GPIOA_CRH_MODE11_SHIFT) & (GPIOA_CRH_MODE11_MASK))

#define GPIOA_CRH_CNF11_SHIFT      (14u)
#define GPIOA_CRH_CNF11_MASK       (0xC000u) // Onl bit 14 15
#define GPIOA_CRH_CNF11(x)         (((x)<<GPIOA_CRH_CNF11_SHIFT) & (GPIOA_CRH_CNF11_MASK))

#define GPIOA_BSRR_BS11_SHIFT      (11u)
#define GPIOA_BSRR_BS11_MASK       (0x800u) // onl bit 11
#define GPIOA_BSRR_BS11(x)         (((x)<<GPIOA_BSRR_BS11_SHIFT) & (GPIOA_BSRR_BS11_MASK))

#define GPIOA_BSRR_BR11_SHIFT      (27u) // bit bat dau
#define GPIOA_BSRR_BR11_MASK       (0x8000000u) // onl bit 27
#define GPIOA_BSRR_BR11(x)         (((x)<<GPIOA_BSRR_BR11_SHIFT) & (GPIOA_BSRR_BR11_MASK))
/* Define to access GPIOA peripheral registers */

