tuananh1592/DoAnFinal1/Stm32Register.h
#define GPIOB_BSRR_BS9_SHIFT       (9u)
#define GPIOB_BSRR_BS9_MASK        (0x200u) // Onl bit 9
#define GPIOB_BSRR_BS9(x)          (((x)<<GPIOB_BSRR_BS9_SHIFT) & (GPIOB_BSRR_BS9_MASK))

#define GPIOB_BSRR_BR9_SHIFT       (25u) // bit bat dau
#define GPIOB_BSRR_BR9_MASK        (0x2000000u) // Onl bit 25
#define GPIOB_BSRR_BR9(x)          (((x)<<GPIOB_BSRR_BR9_SHIFT) & (GPIOB_BSRR_BR9_MASK))

// ---------- PIN12 ----------
#define GPIOB_CRH_MODE12_SHIFT      (16u)
#define GPIOB_CRH_MODE12_MASK       (0x30000u)
#define GPIOB_CRH_MODE12(x)         (((x) << GPIOB_CRH_MODE12_SHIFT) & GPIOB_CRH_MODE12_MASK)

#define GPIOB_CRH_CNF12_SHIFT       (18u)
#define GPIOB_CRH_CNF12_MASK        (0xC0000u)
#define GPIOB_CRH_CNF12(x)          (((x) << GPIOB_CRH_CNF12_SHIFT) & GPIOB_CRH_CNF12_MASK)

#define GPIOB_BSRR_BS12_SHIFT       (12u)
#define GPIOB_BSRR_BS12_MASK        (0x1000u)
#define GPIOB_BSRR_BS12(x)          (((x) << GPIOB_BSRR_BS12_SHIFT) & GPIOB_BSRR_BS12_MASK)

#define GPIOB_BSRR_BR12_SHIFT       (28u)
#define GPIOB_BSRR_BR12_MASK        (0x10000000u)
#define GPIOB_BSRR_BR12(x)          (((x) << GPIOB_BSRR_BR12_SHIFT) & GPIOB_BSRR_BR12_MASK)

// ---------- PIN13 ----------
#define GPIOB_CRH_MODE13_SHIFT      (20u)
#define GPIOB_CRH_MODE13_MASK       (0x300000u)
#define GPIOB_CRH_MODE13(x)         (((x) << GPIOB_CRH_MODE13_SHIFT) & GPIOB_CRH_MODE13_MASK)

#define GPIOB_CRH_CNF13_SHIFT       (22u)
#define GPIOB_CRH_CNF13_MASK        (0xC00000u)
#define GPIOB_CRH_CNF13(x)          (((x) << GPIOB_CRH_CNF13_SHIFT) & GPIOB_CRH_CNF13_MASK)

#define GPIOB_BSRR_BS13_SHIFT       (13u)
#define GPIOB_BSRR_BS13_MASK        (0x2000u)
#define GPIOB_BSRR_BS13(x)          (((x) << GPIOB_BSRR_BS13_SHIFT) & GPIOB_BSRR_BS13_MASK)

#define GPIOB_BSRR_BR13_SHIFT       (29u)
#define GPIOB_BSRR_BR13_MASK        (0x20000000u)
#define GPIOB_BSRR_BR13(x)          (((x) << GPIOB_BSRR_BR13_SHIFT) & GPIOB_BSRR_BR13_MASK)

// ---------- PIN14 ----------
#define GPIOB_CRH_MODE14_SHIFT      (24u)
#define GPIOB_CRH_MODE14_MASK       (0x3000000u)
#define GPIOB_CRH_MODE14(x)         (((x) << GPIOB_CRH_MODE14_SHIFT) & GPIOB_CRH_MODE14_MASK)

#define GPIOB_CRH_CNF14_SHIFT       (26u)
#define GPIOB_CRH_CNF14_MASK        (0xC000000u)
#define GPIOB_CRH_CNF14(x)          (((x) << GPIOB_CRH_CNF14_SHIFT) & GPIOB_CRH_CNF14_MASK)

#define GPIOB_BSRR_BS14_SHIFT       (14u)
#define GPIOB_BSRR_BS14_MASK        (0x4000u)
#define GPIOB_BSRR_BS14(x)          (((x) << GPIOB_BSRR_BS14_SHIFT) & GPIOB_BSRR_BS14_MASK)

#define GPIOB_BSRR_BR14_SHIFT       (30u)
#define GPIOB_BSRR_BR14_MASK        (0x40000000u)
#define GPIOB_BSRR_BR14(x)          (((x) << GPIOB_BSRR_BR14_SHIFT) & GPIOB_BSRR_BR14_MASK)

// ---------- PIN15 ----------
#define GPIOB_CRH_MODE15_SHIFT      (28u)
#define GPIOB_CRH_MODE15_MASK       (0x30000000u)
#define GPIOB_CRH_MODE15(x)         (((x) << GPIOB_CRH_MODE15_SHIFT) & GPIOB_CRH_MODE15_MASK)

#define GPIOB_CRH_CNF15_SHIFT       (30u)
#define GPIOB_CRH_CNF15_MASK        (0xC0000000u)
#define GPIOB_CRH_CNF15(x)          (((x) << GPIOB_CRH_CNF15_SHIFT) & GPIOB_CRH_CNF15_MASK)

#define GPIOB_BSRR_BS15_SHIFT       (15u)
#define GPIOB_BSRR_BS15_MASK        (0x8000u)
#define GPIOB_BSRR_BS15(x)          (((x) << GPIOB_BSRR_BS15_SHIFT) & GPIOB_BSRR_BS15_MASK)

#define GPIOB_BSRR_BR15_SHIFT       (31u)
#define GPIOB_BSRR_BR15_MASK        (0x80000000u)
#define GPIOB_BSRR_BR15(x)          (((x) << GPIOB_BSRR_BR15_SHIFT) & GPIOB_BSRR_BR15_MASK)
/* Define to access GPIOB peripheral registers */

typedef struct
{
    uint32_t CR1;
    uint32_t CR2;
    uint32_t SMCR;
    uint32_t DIER;
    uint32_t SR;
    uint32_t EGR;
    uint32_t CCMR1;
    uint32_t CCMR2;
    uint32_t CCER;
    uint32_t CNT;
    uint32_t PSC;
    uint32_t ARR;
    uint32_t RESERVED_1;
    uint32_t CCR1;
    uint32_t CCR2;
    uint32_t CCR3;
    uint32_t CCR4;
    uint32_t RESERVED_2;
    uint32_t DCR;
    uint32_t DMAR;
} TIM_Type;
/* TIMER2 */
#define TIM2_BASE                   (0x40000000u)
#define TIM2                        ((TIM_Type *)TIM2_BASE)

#define TIM_CR1_CEN_SHIFT           (0u)
#define TIM_CR1_CEN_MASK            (0x1u)
#define TIM_CR1_CEN(x)              (((x) << TIM_CR1_CEN_SHIFT) & (TIM_CR1_CEN_MASK))

#define TIM_PSC_PSC_SHIFT           (0u)
#define TIM_PSC_PSC_MASK            (0xFFFFu)
#define TIM_PSC_PSC(x)               (((x) << TIM_PSC_PSC_SHIFT) & (TIM_PSC_PSC_MASK))

#define TIM_ARR_ARR_SHIFT           (0u)
#define TIM_ARR_ARR_MASK            (0xFFFFu)
#define TIM_ARR_ARR(x)              (((x) << TIM_ARR_ARR_SHIFT) & (TIM_ARR_ARR_MASK))
/* TIMER2 */

/* TIMER3 */
#define TIM3_BASE                   (0x40000400u)
#define TIM3                        ((TIM_Type *)TIM3_BASE)

#define TIM3_CR1_CEN_SHIFT          (0u)
#define TIM3_CR1_CEN_MASK           (0x1u)
#define TIM3_CR1_CEN(x)             (((x) << TIM3_CR1_CEN_SHIFT) & (TIM3_CR1_CEN_MASK))

#define TIM3_PSC_PSC_SHIFT          (0u)
#define TIM3_PSC_PSC_MASK           (0xFFFFu)
#define TIM3_PSC_PSC(x)             (((x) << TIM3_PSC_PSC_SHIFT) & (TIM3_PSC_PSC_MASK))

#define TIM3_ARR_ARR_SHIFT          (0u)
#define TIM3_ARR_ARR_MASK           (0xFFFFu)
#define TIM3_ARR_ARR(x)             (((x) << TIM3_ARR_ARR_SHIFT) & (TIM3_ARR_ARR_MASK))
/* TIMER3 */

typedef struct
{
    uint32_t CR1;
    uint32_t CR2;
    uint32_t OAR1;
    uint32_t OAR2;
    uint32_t DR;
    uint32_t SR1;
    uint32_t SR2;
    uint32_t CCR;
    uint32_t TRISE;
} I2C_TYPE;

#define I2C1 ((I2C_TYPE *) (0x40005400u))

/* để FREQ bằng với APB clock frequency */
#define I2C1_CR2_FREQ_SHIFT (0u)
#define I2C1_CR2_FREQ_MASK (0x3Fu)
#define I2C1_CR2_FREQ(x) (((x)<<I2C1_CR2_FREQ_SHIFT) &  I2C1_CR2_FREQ_MASK)

/* configured CCR 100kHz*/
// tốc độ là sm
#define I2C1_CRR_FS_SHIFT (15u)
#define I2C1_CRR_FS_MASK (0x8000u)
#define I2C1_CRR_FS(x) (((x)<<I2C1_CRR_FS_SHIFT) &  I2C1_CRR_FS_MASK)

// CCR la 100kHz cho SCL
/*
    FREQ = 8 -> T(PCLK1) = 1/FREQ = 0,125us = 125ns
    T(high) = CRR*T(PCLK1); T(low) = CRR*T(PCLK1)
    f(SCL) = 1/(high+low) -> t(scl) = high + low = 2CRR*T(PClK1) -> CRR = t(scl)/2T hay CRR = f(PCLK1)/2F(scl)
    => CRR = 8000000/2*100000 = 40 = 0x28
*/
#define I2C1_CRR_CRR_SHIFT (0u)
#define I2C1_CRR_CRR_MASK (0x28u)
#define I2C1_CRR_CRR(x) (((x)<<I2C1_CRR_CRR_SHIFT) & I2C1_CRR_CRR_MASK)


/* config TRISE
 T(PCLK1) = 125ns;
 Sm có rise time = 1000ns
TRISE = (1000/125) + 1 = 9
 */
#define I2C1_TRISE_SHIFT (0u)
#define I2C1_TRISE_MASK (0x3Fu)
#define I2C1_TRISE(x) (((x)<<I2C1_TRISE_SHIFT) & I2C1_TRISE_MASK)


