tuananh1592/DoAnFinal1/Stm32Register.h
/*peripheral enable*/
#define I2C1_CR1_PE_SHIFT (0u)
#define I2C1_CR1_PE_MASK (0x1u)
#define I2C1_CR1_PE(x) (((x)<<I2C1_CR1_PE_SHIFT)&I2C1_CR1_PE_MASK)

/* START */
#define I2C1_CR1_START_SHIFT (8u)
#define I2C1_CR1_START_MASK (0x100u)
#define I2C1_CR1_START(x) (((x)<<I2C1_CR1_START_SHIFT)&I2C1_CR1_START_MASK)

/* STOP */
#define I2C1_CR1_STOP_SHIFT (9u)
#define I2C1_CR1_STOP_MASK (0x200u)
#define I2C1_CR1_STOP(x) (((x)<<I2C1_CR1_STOP_SHIFT)&I2C1_CR1_STOP_MASK)

/* Address */
#define I2C1_OAR1_ADDMODE_SHIFT (15u)
#define I2C1_OAR1_ADDMODE_MASK (0x8000u)
#define I2C1_OAR1_ADDMODE(x) (((x)<<I2C1_OAR1_ADDMODE_SHIFT) & I2C1_OAR1_ADDMODE_MASK)

/*NOSTRETCH*/
#define I2C1_CR1_NOSTRETCH_SHIFT (7u)
#define I2C1_CR1_NOSTRETCH_MASK (0x80u)
#define I2C1_CR1_NOSTRETCH(x) (((x) << I2C1_CR1_NOSTRETCH_SHIFT) & (I2C1_CR1_NOSTRETCH_MASK))

/*ACK*/
#define I2C1_CR1_ACK_SHIFT (10u)
#define I2C1_CR1_ACK_MASK (0x400u)
#define I2C1_CR1_ACK(x) (((x) << I2C1_CR1_ACK_SHIFT) & (I2C1_CR1_ACK_MASK))

/*SWRST*/
#define I2C1_CR1_SWRST_SHIFT (15u)
#define I2C1_CR1_SWRST_MASK (0x8000)
#define I2C1_CR1_SWRST(x) (((x) << I2C1_CR1_SWRST_SHIFT) & (I2C1_CR1_SWRST_MASK))



/*SR1*/
//AF
#define I2C1_SR1_AF_SHIFT (10u)
#define I2C1_SR1_AF_MASK (0x400u)
#define I2C1_SR1_AF(x) (((x)<<I2C1_SR1_AF_SHIFT)&I2C1_SR1_AF_MASK)

/* check SB */
#define I2C1_SR1_SB_SHIFT (0u)
#define I2C1_SR1_SB_MASK (0x1u)
#define I2C1_SR1_SB(x) (((x)<<I2C1_SR1_SB_SHIFT)&I2C1_SR1_SB_MASK)

//ADDR
#define I2C1_SR1_ADDR_SHIFT (1u)
#define I2C1_SR1_ADDR_MASK (0x2u)
#define I2C1_SR1_ADDR(x) (((x)<<I2C1_SR1_ADDR_SHIFT)&I2C1_SR1_ADDR_MASK)

//BTF
#define I2C1_SR1_BTF_SHIFT (2u)
#define I2C1_SR1_BTF_MASK (0x4u)
#define I2C1_SR1_BTF(x) (((x)<<I2C1_SR1_BTF_SHIFT)&I2C1_SR1_BTF_MASK)

//TxE
#define I2C1_SR1_TxE_SHIFT (7u)
#define I2C1_SR1_TxE_MASK (0x80u)
#define I2C1_SR1_TxE(x) (((x)<<I2C1_SR1_TxE_SHIFT)&I2C1_SR1_TxE_MASK)



/*DR*/
#define I2C1_DR_SHIFT (0u)
#define I2C1_DR_MASK (0xFFu)
#define I2C1_DR(x) (((x)<<I2C1_DR_SHIFT)&I2C1_DR_MASK)


typedef struct
{
    uint32_t SR;
    uint32_t CR1;
    uint32_t CR2;
    uint32_t SMPR1;
    uint32_t SMPR2;
    uint32_t JOFR1;
    uint32_t JOFR2;
    uint32_t JOFR3;
    uint32_t JOFR4;
    uint32_t HTR;
    uint32_t LTR;
    uint32_t SQR1;
    uint32_t SQR2;
    uint32_t SQR3;
    uint32_t JSQR;
    uint32_t JDR1;
    uint32_t JDR2;
    uint32_t JDR3;
    uint32_t JDR4;
    uint32_t DR;
} ADC_Type;

#define ADC1_BASE                   (0x40012400u)
#define ADC1                        ((ADC_Type *)ADC1_BASE)

#define ADC_SR_EOC_SHIFT            (1u)
#define ADC_SR_EOC_MASK             (0x2u)
#define ADC_SR_EOC(x)               (((x) << ADC_SR_EOC_SHIFT) & (ADC_SR_EOC_MASK))

#define ADC_CR1_SCAN_SHIFT          (8u)
#define ADC_CR1_SCAN_MASK           (0x100u)
#define ADC_CR1_SCAN(x)             (((x) << ADC_CR1_SCAN_SHIFT) & (ADC_CR1_SCAN_MASK))

#define ADC_CR2_ADON_SHIFT          (0u)
#define ADC_CR2_ADON_MASK           (0x1u)
#define ADC_CR2_ADON(x)             (((x) << ADC_CR2_ADON_SHIFT) & (ADC_CR2_ADON_MASK))

#define ADC_CR2_CONT_SHIFT          (1u)
#define ADC_CR2_CONT_MASK           (0x2u)
#define ADC_CR2_CONT(x)             (((x) << ADC_CR2_CONT_SHIFT) & (ADC_CR2_CONT_MASK))

#define ADC_CR2_ALIGN_SHIFT         (11u)
#define ADC_CR2_ALIGN_MASK          (0x800u)
#define ADC_CR2_ALIGN(x)            (((x) << ADC_CR2_ALIGN_SHIFT) & (ADC_CR2_ALIGN_MASK))

#define ADC_CR2_SWSTART_SHIFT       (22u)
#define ADC_CR2_SWSTART_MASK        (0x400000u)
#define ADC_CR2_SWSTART(x)          (((x) << ADC_CR2_SWSTART_SHIFT) & (ADC_CR2_SWSTART_MASK))

#define ADC_SMPR2_SMP0_SHIFT        (0u)
#define ADC_SMPR2_SMP0_MASK         (0x7u)
#define ADC_SMPR2_SMP0(x)           (((x) << ADC_SMPR2_SMP0_SHIFT) & (ADC_SMPR2_SMP0_MASK))

#define ADC_SQR1_L_SHIFT            (20u)
#define ADC_SQR1_L_MASK             (0xF00000u)
#define ADC_SQR1_L(x)               (((x) << ADC_SQR1_L_SHIFT) & (ADC_SQR1_L_MASK))

#define ADC_SQR3_SQ1_SHIFT          (0u)
#define ADC_SQR3_SQ1_MASK           (0x1Fu)
#define ADC_SQR3_SQ1(x)             (((x) << ADC_SQR3_SQ1_SHIFT) & (ADC_SQR3_SQ1_MASK))

#define ADC_DR_DATA_SHIFT           (0u)
#define ADC_DR_DATA_MASK            (0xFFFFu)
#define ADC_DR_DATA(x)              (((x) << ADC_DR_DATA_SHIFT) & (ADC_DR_DATA_MASK))


#endif /* STM32REGISTER_H_ */
